## Introduction to Pandas: Series and Dataframes

Series: like one dimensional array, not restricted to just numeric types, optimised for iterating through values. Built on top of numpy.

Dataframe : like Two dimensional array with row indices and column names. Can contain Mixed type attributes.

Series:

In [1]:
# Create a Series : using pd.Series(numpy_array)
import pandas as pd 
import numpy as np

m = pd.Series([1,2,3,4,5])

# print m
m

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2]:
# Accessing elements of a series : like a 1d list 
# to print single index
m[1]

2

In [3]:
# to print set of indices(rows) : print all rows from index 1
m[1:]

1    2
2    3
3    4
4    5
dtype: int64

In [4]:
# we can print random indexed rows 
# NOTE: m[1,3] will not work to print indices 1 and 3, We need pass in a list like [1,3] in original []
m[[1,3]]

1    2
3    4
dtype: int64

In [5]:
#To contrast with numpy array and pandas series, we have an apply() that applies a function to each element of it. and this is supported only for pandas series.
np.arange(10).apply(lambda x:x+1)

AttributeError: 'numpy.ndarray' object has no attribute 'apply'

In [6]:
pd.Series([1,2,3,4]).apply(lambda x:x+1)

0    2
1    3
2    4
3    5
dtype: int64

Dataframes: Real world data is mentioned i this format. Every row is an object and every column is an attribute.

In [ ]:
Creating Dataframes : many Ways
1) from Dictionary
2) from csv file
3) from json file
4) from text file

In [ ]:
# 1) from Dictionary:
df = pd.DataFrame({'Name':['Santoshkumar vagga', 'Suraj Chauhan', 'Satish Biradar', 'Uday Poddar'],
                    'Age':[25,26,24,27],
                    'Education':['M.Sc','M.D', 'B.E', 'M.E']})
df

In [8]:
# 2) from csv: NOTE: Save as CSV(Comma delimited)
df = pd.read_csv("sample_book.csv")
df

,Team,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
0,RCB,Virat Kohli,AB de villers,NaN,12,40,IPL,30-35
1,MI,Rohit Sharma,K Pollard,5.0,12,38,IPL,30-35
2,CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40
3,KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30
4,KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35
5,SRH,Dwarner,M Pandey,1.0,7,39,IPL,20-25
6,DC,S Iyer,R Pant,2.0,12,40,Domestic,20-25
7,RR,S Smith,A Rahane,1.0,8,39,Domestic,25-30

Reading and Summarising Dataframes

In [9]:
# Print top 5 rows
df.head()

,Team,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
0,RCB,Virat Kohli,AB de villers,NaN,12,40,IPL,30-35
1,MI,Rohit Sharma,K Pollard,5.0,12,38,IPL,30-35
2,CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40
3,KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30
4,KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35

In [10]:
# print last 5 rows
df.tail()

,Team,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
3,KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30
4,KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35
5,SRH,Dwarner,M Pandey,1.0,7,39,IPL,20-25
6,DC,S Iyer,R Pant,2.0,12,40,Domestic,20-25
7,RR,S Smith,A Rahane,1.0,8,39,Domestic,25-30

In [11]:
# to know datatypes of each column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Team           8 non-null      object
 1   Captain        8 non-null      object
 2   Vice_Captain   8 non-null      object
 3   Won_times      6 non-null      float64
 4   Total_Seasons  8 non-null      int64
 5   Squad_team     8 non-null      int64
 6   Type           8 non-null      object
 7   Age            8 non-null      object
dtypes: float64(1), int64(2), object(5)
memory usage: 640.0+ bytes

In [12]:
# to know total rows and columns
df.shape

(8, 8)

In [13]:
# to get numerical statistics of each column like mean, min, max(only for numeric type columns)
df.describe()

       Won_times  Total_Seasons  Squad_team
count   6.000000       8.000000    8.000000
mean    2.333333      10.000000   39.625000
std     1.505545       2.070197    1.407886
min     1.000000       7.000000   38.000000
25%     1.250000       8.000000   38.750000
50%     2.000000      10.500000   39.500000
75%     2.750000      12.000000   40.250000
max     5.000000      12.000000   42.000000

In [14]:
# get all column names of dataframe
df.columns

Index(['Team', 'Captain', 'Vice_Captain', 'Won_times', 'Total_Seasons',
       'Squad_team', 'Type', 'Age'],
      dtype='object')

In [15]:
# get each row as numpy array
df.values

array([['RCB', 'Virat Kohli', 'AB de villers', nan, 12, 40, 'IPL',
        '30-35'],
       ['MI', 'Rohit Sharma', 'K Pollard', 5.0, 12, 38, 'IPL', '30-35'],
       ['CSK', 'MS Dhoni', 'A Jadeja', 3.0, 10, 41, 'ODI', '35-40'],
       ['KXP', 'KL Rahul', 'M Agarwal', nan, 11, 42, 'ODI', '25-30'],
       ['KKR', 'D Kartik', 'A Russel', 2.0, 8, 38, 'ODI', '30-35'],
       ['SRH', 'Dwarner', 'M Pandey', 1.0, 7, 39, 'IPL', '20-25'],
       ['DC', 'S Iyer', 'R Pant', 2.0, 12, 40, 'Domestic', '20-25'],
       ['RR', 'S Smith', 'A Rahane', 1.0, 8, 39, 'Domestic', '25-30']],
      dtype=object)

Set custom index column: using set_index()

In [16]:
df = pd.read_csv("sample_book.csv")
df.set_index('Team', inplace=True)
df

,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
Team,,,,,,,
RCB,Virat Kohli,AB de villers,NaN,12,40,IPL,30-35
MI,Rohit Sharma,K Pollard,5.0,12,38,IPL,30-35
CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40
KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30
KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35
SRH,Dwarner,M Pandey,1.0,7,39,IPL,20-25
DC,S Iyer,R Pant,2.0,12,40,Domestic,20-25
RR,S Smith,A Rahane,1.0,8,39,Domestic,25-30

Sorting Dataframes:

1) Sorting Index:

In [17]:
# 1) Sort Index: using sort_index() 
import pandas as pd
df = pd.read_csv("sample_book.csv")
df.set_index('Team', inplace=True)
df.sort_index(ascending=True, inplace = True)
df

,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
Team,,,,,,,
CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40
DC,S Iyer,R Pant,2.0,12,40,Domestic,20-25
KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35
KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30
MI,Rohit Sharma,K Pollard,5.0,12,38,IPL,30-35
RCB,Virat Kohli,AB de villers,NaN,12,40,IPL,30-35
RR,S Smith,A Rahane,1.0,8,39,Domestic,25-30
SRH,Dwarner,M Pandey,1.0,7,39,IPL,20-25

2) Sorting Values: We can also sort by any custom column(s)

In [18]:
# using sort_values(axis=0, ascending = Truem inplace=True)
# Note: if axis =1, it considers coulumn wise. if axis = 0, then it considers row wise.

In [19]:
df.sort_values('Squad_team', ascending=False, inplace=True)
df

,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
Team,,,,,,,
KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30
CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40
DC,S Iyer,R Pant,2.0,12,40,Domestic,20-25
RCB,Virat Kohli,AB de villers,NaN,12,40,IPL,30-35
RR,S Smith,A Rahane,1.0,8,39,Domestic,25-30
SRH,Dwarner,M Pandey,1.0,7,39,IPL,20-25
KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35
MI,Rohit Sharma,K Pollard,5.0,12,38,IPL,30-35

In [20]:
# We can also perform sorting using >1 columns: It will sort using second column , then for the result it applies sorting based on first column given. (REVERSE order)
df.sort_values(by=['Total_Seasons', 'Squad_team'], ascending=True, inplace=True)
df

,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
Team,,,,,,,
SRH,Dwarner,M Pandey,1.0,7,39,IPL,20-25
KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35
RR,S Smith,A Rahane,1.0,8,39,Domestic,25-30
CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40
KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30
MI,Rohit Sharma,K Pollard,5.0,12,38,IPL,30-35
DC,S Iyer,R Pant,2.0,12,40,Domestic,20-25
RCB,Virat Kohli,AB de villers,NaN,12,40,IPL,30-35

In [8]:
# This value_counts() can be used as mode()- to get most frequent value in a dataframe series.
# for rest of aggregate functions, we have mean(), median(), min(),max(),sum(), etc. 
# But, all this can be summarised once using one command- describe()
import pandas as pd
df = pd.read_csv("sample_book.csv")
df["Captain"].value_counts(dropna=False)

Rohit Sharma    1
S Smith         1
MS Dhoni        1
Dwarner         1
Virat Kohli     1
S Iyer          1
D Kartik        1
KL Rahul        1
Name: Captain, dtype: int64

Indexing and Selecting data:

1) Selecting rows from a dataframe
2) Selecting columns from a dataframe
3) Selecting columns from a dataframe

In [9]:
# 1) Selecting rows:
df[2:6]

,Team,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
2,CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40
3,KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30
4,KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35
5,SRH,Dwarner,M Pandey,1.0,7,39,IPL,20-25

In [23]:
# Selecting alternate rows (from 3rd row to till last but in alternate fashion)
df[3::2]

,Team,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
3,KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30
5,SRH,Dwarner,M Pandey,1.0,7,39,IPL,20-25
7,RR,S Smith,A Rahane,1.0,8,39,Domestic,25-30

In [12]:
# 2) Selecting Columns: Each Column is a pandas series. 2 ways: a) using [] 2) using .NOTE: We can extract both as Series and Dataframe
# a) using [] : as Series.
df['Captain']

0     Virat Kohli
1    Rohit Sharma
2        MS Dhoni
3        KL Rahul
4        D Kartik
5         Dwarner
6          S Iyer
7         S Smith
Name: Captain, dtype: object

In [13]:
type(df['Captain'])

pandas.core.series.Series

In [14]:
# b) using . : as Series
df.Captain

0     Virat Kohli
1    Rohit Sharma
2        MS Dhoni
3        KL Rahul
4        D Kartik
5         Dwarner
6          S Iyer
7         S Smith
Name: Captain, dtype: object

In [15]:
type(df.Captain)

pandas.core.series.Series

In [16]:
# as Dataframe : Just embed in []
df[["Captain"]]

        Captain
0   Virat Kohli
1  Rohit Sharma
2      MS Dhoni
3      KL Rahul
4      D Kartik
5       Dwarner
6        S Iyer
7       S Smith

In [17]:
type(df[["Captain"]])

pandas.core.frame.DataFrame

In [18]:
# Selecting multiple columns : returns always a Dataframe
# NOTE: dont specify Index in list, since it appears by default for every row
df[['Captain', 'Total_Seasons']]

        Captain  Total_Seasons
0   Virat Kohli             12
1  Rohit Sharma             12
2      MS Dhoni             10
3      KL Rahul             11
4      D Kartik              8
5       Dwarner              7
6        S Iyer             12
7       S Smith              8

In [19]:
type(df[['Captain', 'Total_Seasons']])

pandas.core.frame.DataFrame

In [20]:
# Unlike Series(1D array), We cannot access a Dataframe by Just One parameter like Dataframe[2].

In [21]:
df

,Team,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
0,RCB,Virat Kohli,AB de villers,NaN,12,40,IPL,30-35
1,MI,Rohit Sharma,K Pollard,5.0,12,38,IPL,30-35
2,CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40
3,KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30
4,KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35
5,SRH,Dwarner,M Pandey,1.0,7,39,IPL,20-25
6,DC,S Iyer,R Pant,2.0,12,40,Domestic,20-25
7,RR,S Smith,A Rahane,1.0,8,39,Domestic,25-30

In [22]:
# To print only even number rows in Dataframe
df[2::2]

,Team,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
2,CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40
4,KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35
6,DC,S Iyer,R Pant,2.0,12,40,Domestic,20-25

## Pandas recommneds to use below 2 approcahes for indexing, subsetting. Since they are more explicit.
#1) Position based Indexing: using df.iloc
#2) Label based indexing: using df.loc

In [23]:
# 1) Position based Indexing: # Use help(pd.DataFrame.iloc) for detailed info
# df.iloc[  a , b ] 
# a = row info, can be single digit or a list. 
# b = column info, can be single digit or a list

# Possible Combinations for a or b:
# m:n
# here, m is starting index and n-1 is ending Index

In [30]:
df.iloc[2] # series output, print third row, all columns

Team                  CSK
Captain          MS Dhoni
Vice_Captain     A Jadeja
Won_times               3
Total_Seasons          10
Squad_team             41
Type                  ODI
Age                 35-40
Name: 2, dtype: object

In [29]:
df.iloc[[2]] # Dataframe output, print tird row, all columns

,Team,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
2,CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40

In [38]:
df.iloc[[2,3,4],[1,2,3]] # 3,4,5th rows and 2,3,4th columns

    Captain Vice_Captain  Won_times
2  MS Dhoni     A Jadeja        3.0
3  KL Rahul    M Agarwal        NaN
4  D Kartik     A Russel        2.0

In [39]:
df.iloc[2:6,3:5] # 3,4,5,6th row and 4, 5th column

   Won_times  Total_Seasons
2        3.0             10
3        NaN             11
4        2.0              8
5        1.0              7

In [40]:
df.iloc[[2:4]]

SyntaxError: invalid syntax (<ipython-input-40-d9dc4857998e>, line 1)

In [96]:
# Using boolena array: selects only rows corresponding to true.
df.iloc[[True, True,False, True, False, True, False,True]]

           Captain   Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH        Dwarner       M Pandey        1.0              7          39
KKR       D Kartik       A Russel        2.0              8          38
CSK       MS Dhoni       A Jadeja        3.0             10          41
MI    Rohit Sharma      K Pollard        5.0             12          38
RCB    Virat Kohli  AB de villers        NaN             12          40

In [97]:
# 1) Selecting based on Labels: using df.loc
# WKT it is possible to have our own custom index.

df

           Captain   Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH        Dwarner       M Pandey        1.0              7          39
KKR       D Kartik       A Russel        2.0              8          38
RR         S Smith       A Rahane        1.0              8          39
CSK       MS Dhoni       A Jadeja        3.0             10          41
KXP       KL Rahul      M Agarwal        NaN             11          42
MI    Rohit Sharma      K Pollard        5.0             12          38
DC          S Iyer         R Pant        2.0             12          40
RCB    Virat Kohli  AB de villers        NaN             12          40

In [103]:
df.loc[['SRH', 'KXP', 'MI'], :]

           Captain Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH        Dwarner     M Pandey        1.0              7          39
KXP       KL Rahul    M Agarwal        NaN             11          42
MI    Rohit Sharma    K Pollard        5.0             12          38

In [106]:
df.loc[['SRH', 'KXP', 'MI'], 'Vice_Captain':'Squad_team']

     Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH      M Pandey        1.0              7          39
KXP     M Agarwal        NaN             11          42
MI      K Pollard        5.0             12          38

Subsetting Dataframes based on Conditions:

In [107]:
df

           Captain   Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH        Dwarner       M Pandey        1.0              7          39
KKR       D Kartik       A Russel        2.0              8          38
RR         S Smith       A Rahane        1.0              8          39
CSK       MS Dhoni       A Jadeja        3.0             10          41
KXP       KL Rahul      M Agarwal        NaN             11          42
MI    Rohit Sharma      K Pollard        5.0             12          38
DC          S Iyer         R Pant        2.0             12          40
RCB    Virat Kohli  AB de villers        NaN             12          40

In [112]:
# using a boolean array: df['Won_times']>2.0
df.loc[df['Won_times']>2.0]

           Captain Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
CSK       MS Dhoni     A Jadeja        3.0             10          41
MI    Rohit Sharma    K Pollard        5.0             12          38

In [113]:
# Equivalent to above one
df.loc[df['Won_times']>2.0, ]

           Captain Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
CSK       MS Dhoni     A Jadeja        3.0             10          41
MI    Rohit Sharma    K Pollard        5.0             12          38

In [114]:
df

           Captain   Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH        Dwarner       M Pandey        1.0              7          39
KKR       D Kartik       A Russel        2.0              8          38
RR         S Smith       A Rahane        1.0              8          39
CSK       MS Dhoni       A Jadeja        3.0             10          41
KXP       KL Rahul      M Agarwal        NaN             11          42
MI    Rohit Sharma      K Pollard        5.0             12          38
DC          S Iyer         R Pant        2.0             12          40
RCB    Virat Kohli  AB de villers        NaN             12          40

In [116]:
df.loc[(df.Total_Seasons>8) & (df.Squad_team>40)]

       Captain Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
CSK   MS Dhoni     A Jadeja        3.0             10          41
KXP   KL Rahul    M Agarwal        NaN             11          42

In [118]:
df.loc[(df.Total_Seasons>8) | (df.Squad_team>40)]

           Captain   Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
CSK       MS Dhoni       A Jadeja        3.0             10          41
KXP       KL Rahul      M Agarwal        NaN             11          42
MI    Rohit Sharma      K Pollard        5.0             12          38
DC          S Iyer         R Pant        2.0             12          40
RCB    Virat Kohli  AB de villers        NaN             12          40

In [125]:
# We can filter column to have selected rows. NOTE: Items in List should be part of Column under filter.
valid_rows = ['A Jadeja', 'R Pant']
df.loc[df.Vice_Captain.isin(valid_rows)]

       Captain Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
CSK   MS Dhoni     A Jadeja        3.0             10          41
DC      S Iyer       R Pant        2.0             12          40

## Merge and Append(Concat):

##1) Merging two or more dataframes using pd.merge()

In [18]:
df_1 = df
df_2 = pd.read_csv("sample_workbook_2.csv")
df_2

      Captain  ODI_RUNS  Catches
0  R Pointing     14000      700
1   S Ganguly     12000      710
2    R Dravid     11000      800

In [20]:
# how = "inner" makes merge using same column in both dataframes so we will have all columns in both dataframes but only one common column
pd.merge(df_1, df_2, how="inner", on="Captain")

Empty DataFrame
Columns: [Team, Captain, Vice_Captain, Won_times, Total_Seasons, Squad_team, Type, ODI_RUNS, Catches]
Index: []

Concatinate: using pd.concat()

In [ ]:
# 2 ways :
# 1) Concatenate along rows : use axis = 0 (default) [NOTE: no. of columns and thier labels should be same]
# 2) Concatenate along column: use axis = 1 [ NOTE: no. of rows should be same]

In [133]:
df_3 = pd.read_csv("sample_workbook_3.csv")
df_3

      Captain  ODI_RUNS  Catches
0  R Pointing     14000      700
1   S Ganguly     12000      710
2    R Dravid     11000      800

In [136]:
df_2

        Captain  ODI_RUNS  Catches
0   Virat Kohli     25000      840
1  Rohit Sharma     13000      490
2      MS Dhoni     12000     1280
3      KL Rahul      3000      390
4      D Kartik      3500      320
5       Dwarner      8000      790
6        S Iyer      1000      321
7       S Smith      8000      800

In [138]:
# Lets Concatennate df_2 and df_3 along rows(axis = 0)
pd.concat([df_2, df_3], axis=0)

        Captain  ODI_RUNS  Catches
0   Virat Kohli     25000      840
1  Rohit Sharma     13000      490
2      MS Dhoni     12000     1280
3      KL Rahul      3000      390
4      D Kartik      3500      320
5       Dwarner      8000      790
6        S Iyer      1000      321
7       S Smith      8000      800
0    R Pointing     14000      700
1     S Ganguly     12000      710
2      R Dravid     11000      800

In [139]:
# Lets Concatenate along columns (axis = 1)
pd.concat([df_2, df_3], axis =1)

        Captain  ODI_RUNS  Catches     Captain  ODI_RUNS  Catches
0   Virat Kohli     25000      840  R Pointing   14000.0    700.0
1  Rohit Sharma     13000      490   S Ganguly   12000.0    710.0
2      MS Dhoni     12000     1280    R Dravid   11000.0    800.0
3      KL Rahul      3000      390         NaN       NaN      NaN
4      D Kartik      3500      320         NaN       NaN      NaN
5       Dwarner      8000      790         NaN       NaN      NaN
6        S Iyer      1000      321         NaN       NaN      NaN
7       S Smith      8000      800         NaN       NaN      NaN

In [140]:
# NOTE: We can also do Concatenation using append() of Dataframe. (Till now we used pandas method)
df_1

           Captain   Vice_Captain  Won_times  Total_Seasons  Squad_team
Team
SRH        Dwarner       M Pandey        1.0              7          39
KKR       D Kartik       A Russel        2.0              8          38
RR         S Smith       A Rahane        1.0              8          39
CSK       MS Dhoni       A Jadeja        3.0             10          41
KXP       KL Rahul      M Agarwal        NaN             11          42
MI    Rohit Sharma      K Pollard        5.0             12          38
DC          S Iyer         R Pant        2.0             12          40
RCB    Virat Kohli  AB de villers        NaN             12          40

In [141]:
df_2

        Captain  ODI_RUNS  Catches
0   Virat Kohli     25000      840
1  Rohit Sharma     13000      490
2      MS Dhoni     12000     1280
3      KL Rahul      3000      390
4      D Kartik      3500      320
5       Dwarner      8000      790
6        S Iyer      1000      321
7       S Smith      8000      800

In [142]:
df_1.append(df_2)

,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,ODI_RUNS,Catches
SRH,Dwarner,M Pandey,1.0,7.0,39.0,NaN,NaN
KKR,D Kartik,A Russel,2.0,8.0,38.0,NaN,NaN
RR,S Smith,A Rahane,1.0,8.0,39.0,NaN,NaN
CSK,MS Dhoni,A Jadeja,3.0,10.0,41.0,NaN,NaN
KXP,KL Rahul,M Agarwal,NaN,11.0,42.0,NaN,NaN
MI,Rohit Sharma,K Pollard,5.0,12.0,38.0,NaN,NaN
DC,S Iyer,R Pant,2.0,12.0,40.0,NaN,NaN
RCB,Virat Kohli,AB de villers,NaN,12.0,40.0,NaN,NaN
0,Virat Kohli,NaN,NaN,NaN,NaN,25000.0,840.0
1,Rohit Sharma,NaN,NaN,NaN,NaN,13000.0,490.0
2,MS Dhoni,NaN,NaN,NaN,NaN,12000.0,1280.0
3,KL Rahul,NaN,NaN,NaN,NaN,3000.0,390.0
4,D Kartik,NaN,NaN,NaN,NaN,3500.0,320.0
5,Dwarner,NaN,NaN,NaN,NaN,8000.0,790.0
6,S Iyer,NaN,NaN,NaN,NaN,1000.0,321.0
7,S Smith,NaN,NaN,NaN,NaN,8000.0,800.0

Grouping and Summarizing Dataframes

In [23]:
df = pd.read_csv("sample_book.csv")
df

,Team,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
0,RCB,Virat Kohli,AB de villers,NaN,12,40,IPL,30-35
1,MI,Rohit Sharma,K Pollard,5.0,12,38,IPL,30-35
2,CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40
3,KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30
4,KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35
5,SRH,Dwarner,M Pandey,1.0,7,39,IPL,20-25
6,DC,S Iyer,R Pant,2.0,12,40,Domestic,20-25
7,RR,S Smith,A Rahane,1.0,8,39,Domestic,25-30

In [24]:
# first create few records with same values for some column for which we need to group
df_gp_ob = df.groupby("Type")
df_gp_ob["Total_Seasons"].sum()

Type
Domestic    20
IPL         31
ODI         29
Name: Total_Seasons, dtype: int64

In [25]:
# convert to Dataframe
pd.DataFrame(df_gp_ob["Total_Seasons"].sum())

          Total_Seasons
Type
Domestic             20
IPL                  31
ODI                  29

Aggregation : using group by object

In [26]:
# Aggregation operations: Mean, Median, Min, Max, (Usally describe() will give you all of these at once even 25% 50% 75% as well)

df_gp_ob["Total_Seasons"].mean()

Type
Domestic    10.000000
IPL         10.333333
ODI          9.666667
Name: Total_Seasons, dtype: float64

In [27]:
df_gp_ob["Total_Seasons"].median()

Type
Domestic    10
IPL         12
ODI         10
Name: Total_Seasons, dtype: int64

In [29]:
df_gp_ob["Total_Seasons"].min()

Type
Domestic    8
IPL         7
ODI         8
Name: Total_Seasons, dtype: int64

In [30]:
df_gp_ob["Total_Seasons"].max()

Type
Domestic    12
IPL         12
ODI         11
Name: Total_Seasons, dtype: int64

In [31]:
df_gp_ob["Total_Seasons"].describe()

          count       mean       std  min  25%   50%   75%   max
Type
Domestic    2.0  10.000000  2.828427  8.0  9.0  10.0  11.0  12.0
IPL         3.0  10.333333  2.886751  7.0  9.5  12.0  12.0  12.0
ODI         3.0   9.666667  1.527525  8.0  9.0  10.0  10.5  11.0

In [32]:
# we can groupby using multiple columns
df

,Team,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
0,RCB,Virat Kohli,AB de villers,NaN,12,40,IPL,30-35
1,MI,Rohit Sharma,K Pollard,5.0,12,38,IPL,30-35
2,CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40
3,KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30
4,KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35
5,SRH,Dwarner,M Pandey,1.0,7,39,IPL,20-25
6,DC,S Iyer,R Pant,2.0,12,40,Domestic,20-25
7,RR,S Smith,A Rahane,1.0,8,39,Domestic,25-30

In [36]:
df_gp_obj = df.groupby(['Total_Seasons', 'Age'])
# here, grouby occurs first on basis of first argument, then by second argument, so on.
pd.DataFrame(df_gp_obj['Won_times'].sum())

                     Won_times
Total_Seasons Age
7             20-25        1.0
8             25-30        1.0
              30-35        2.0
10            35-40        3.0
11            25-30        0.0
12            20-25        2.0
              30-35        5.0

In [12]:
# We can create a new column in a Dataframe using other columns
df = pd.read_csv("sample_book.csv")
df

,Team,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age
0,RCB,Virat Kohli,AB de villers,NaN,12,40,IPL,30-35
1,MI,Rohit Sharma,K Pollard,5.0,12,38,IPL,30-35
2,CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40
3,KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30
4,KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35
5,SRH,Dwarner,M Pandey,1.0,7,39,IPL,20-25
6,DC,S Iyer,R Pant,2.0,12,40,Domestic,20-25
7,RR,S Smith,A Rahane,1.0,8,39,Domestic,25-30

In [14]:
# Creating a new column in the dataframe
df['Squad_change_ratio'] = df["Squad_team"]/df["Total_Seasons"]
df

,Team,Captain,Vice_Captain,Won_times,Total_Seasons,Squad_team,Type,Age,Squad_change_ratio
0,RCB,Virat Kohli,AB de villers,NaN,12,40,IPL,30-35,3.333333
1,MI,Rohit Sharma,K Pollard,5.0,12,38,IPL,30-35,3.166667
2,CSK,MS Dhoni,A Jadeja,3.0,10,41,ODI,35-40,4.100000
3,KXP,KL Rahul,M Agarwal,NaN,11,42,ODI,25-30,3.818182
4,KKR,D Kartik,A Russel,2.0,8,38,ODI,30-35,4.750000
5,SRH,Dwarner,M Pandey,1.0,7,39,IPL,20-25,5.571429
6,DC,S Iyer,R Pant,2.0,12,40,Domestic,20-25,3.333333
7,RR,S Smith,A Rahane,1.0,8,39,Domestic,25-30,4.875000

In [51]:
# To get total share of a particular group:
df_gp_ob = df.groupby(['Total_Seasons'])
pd.DataFrame((df_gp_ob["Squad_team"].sum()/df['Squad_team'].sum())*100)
# Below data reveals Teams who played 12 Seasons have big Squad with them.

               Squad_team
Total_Seasons
7               12.302839
8               24.290221
10              12.933754
11              13.249211
12              37.223975

In [7]:
# Pivot Table: Alternative to Group By 
# Useful when we want to summarise two categorical columns. But dangerous since pivot_table has some special defaults.
# Syntax: pd.pivot_table(dataframe, index = col_name_as_index, values = col_on_which_we_want_to_apply_agg_func", aggfunc = "sum/median/.."
# Note : for mode(), use value_counts()

df = pd.read_excel("sales-funnel.xlsx")
df.to_csv("sales-funnel.csv", encoding = 'utf-8', index=False)
df

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
6,218895,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000,presented
7,412290,Jerde-Hilpert,John Smith,Debra Henley,Maintenance,2,5000,pending
8,740150,Barton LLC,John Smith,Debra Henley,CPU,1,35000,declined
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented

In [9]:
pd.pivot_table(df, index='Name', columns='Manager')

                                  Account                      Price  \
Manager                      Debra Henley Fred Anderson Debra Henley
Name
Barton LLC                       740150.0           NaN      35000.0
Fritsch, Russel and Anderson     737550.0           NaN      35000.0
Herman LLC                            NaN      141962.0          NaN
Jerde-Hilpert                    412290.0           NaN       5000.0
Kassulke, Ondricka and Metz           NaN      307599.0          NaN
Keeling LLC                           NaN      688981.0          NaN
Kiehn-Spinka                     146832.0           NaN      65000.0
Koepp Ltd                             NaN      729833.0          NaN
Kulas Inc                        218895.0           NaN      25000.0
Purdy-Kunde                           NaN      163416.0          NaN
Stokes LLC                            NaN      239344.0          NaN
Trantow-Barrows                  714466.0           NaN      15000.0

                                               Quantity
Manager                      Fred Anderson Debra Henley Fred Anderson
Name
Barton LLC                             NaN     1.000000           NaN
Fritsch, Russel and Anderson           NaN     1.000000           NaN
Herman LLC                         65000.0          NaN           2.0
Jerde-Hilpert                          NaN     2.000000           NaN
Kassulke, Ondricka and Metz         7000.0          NaN           3.0
Keeling LLC                       100000.0          NaN           5.0
Kiehn-Spinka                           NaN     2.000000           NaN
Koepp Ltd                          35000.0          NaN           2.0
Kulas Inc                              NaN     1.500000           NaN
Purdy-Kunde                        30000.0          NaN           1.0
Stokes LLC                          7500.0          NaN           1.0
Trantow-Barrows                        NaN     1.333333           NaN

In [ ]:
# pandas pivot tables are exceedingly useful. refer - 
# https://pbpython.com/pandas-pivot-table-explained.html#:~:text=%20Pandas%20Pivot%20Table%20Explained%20%201%20Introduction.,a%20time.%20Add%20items%20and%20check...%20More%20